tutorials/multiphase/reactingMultiphaseEulerFoam/laminar/biomassPyrolsis/ranziDevolatilization/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default     Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default                         none;

    "div\(phi,alpha.*\)"            Gauss vanLeer;
    "div\(phir,alpha.*\)"           Gauss vanLeer;

    "div\(alphaRhoPhi.*,U.*\)"      Gauss limitedLinearV 1;
    "div\(phi.*,U.*\)"              Gauss limitedLinearV 1;
    "div\(U.*\)"                    Gauss linear;

    "div\(alphaRhoPhi.*,(h|e|Yi).*\)"  Gauss upwind 1;
    "div\(alphaRhoPhi.*,K.*\)"      Gauss limitedLinear 1;
    "div\(alphaPhi.*,p\)"           Gauss limitedLinear 1;

    "div\(phiCorr,alpha.*\)"        Gauss limitedLinear 1;
    "div\(alphaRhoPhi.particles.*,Theta.particles.*\)" Gauss limitedLinear 1;
    "div\(alphaRhoPhi.*,(k|epsilon).*\)"  Gauss limitedLinear 1;

    div((((alpha.air*thermo:rho.air)*nuEff.air)*dev2(T(grad(U.air))))) Gauss linear;

    "div\(\(\(\(thermo:rho.*nut.*\)*dev2\(T\(grad\(U.*\)\)\)\)+\(\(\(thermo:rho.*lambda.*\)*div\(phi.*\)\)*I\)\)\)"  Gauss linear;

    div((((thermo:rho.particles1*nut.particles1)*dev2(T(grad(U.particles1))))+(((thermo:rho.particles1*lambda.particles1)*div(phi.particles1))*I)))  Gauss linear;

    div((((thermo:rho.particles2*nut.particles2)*dev2(T(grad(U.particles2))))+(((thermo:rho.particles2*lambda.particles2)*div(phi.particles2))*I)))  Gauss linear;

    "div\(\(\(\(alpha.*thermo:rho.*\)*nuEff.*\)*dev2\(T\(grad\(U.*\)\)\)\)\)" Gauss linear;

}

laplacianSchemes
{
    default     Gauss linear uncorrected;
    bounded     Gauss linear uncorrected;
}

interpolationSchemes
{
    default     linear;
}

snGradSchemes
{
    default     corrected;
    bounded     corrected;
    "snGrad\(alpha.*\)" limited 0.33;
}

wallDist
{
    method      meshWave;
}


// ************************************************************************* //
